CSI API ETABS v1
cAreaObj.GetLoadUniformToFrame Method
 NOT APPLICABLE - Retrieves the uniform to frame load assignments to area objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadUniformToFrame(
	string Name,
	ref int NumberItems,
	ref string[] AreaName,
	ref string[] LoadPat,
	ref string[] CSys,
	ref int[] Dir,
	ref double[] Value,
	ref int[] DistType,
	eItemType ItemType = eItemType.Objects
)
Function GetLoadUniformToFrame (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef AreaName As String(),
	ByRef LoadPat As String(),
	ByRef CSys As String(),
	ByRef Dir As Integer(),
	ByRef Value As Double(),
	ByRef DistType As Integer(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberItems As Integer
Dim AreaName As String()
Dim LoadPat As String()
Dim CSys As String()
Dim Dir As Integer()
Dim Value As Double()
Dim DistType As Integer()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLoadUniformToFrame(Name,
	NumberItems, AreaName, LoadPat, CSys,
	Dir, Value, DistType, ItemType)
int GetLoadUniformToFrame(
	String^ Name,
	int% NumberItems,
	array<String^>^% AreaName,
	array<String^>^% LoadPat,
	array<String^>^% CSys,
	array<int>^% Dir,
	array<double>^% Value,
	array<int>^% DistType,
	eItemType ItemType = eItemType::Objects
)
abstract GetLoadUniformToFrame :
        Name : string *
        NumberItems : int byref *
        AreaName : string[] byref *
        LoadPat : string[] byref *
        CSys : string[] byref *
        Dir : int[] byref *
        Value : float[] byref *
        DistType : int[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of uniform to frame loads retrieved for the specified area objects.
AreaName
Type: System.String[]
 This is an array that includes the name of the area object associated with each uniform to frame load.
LoadPat
Type: System.String[]
 This is an array that includes the name of the load pattern associated with each uniform to frame load.
CSys
Type: System.String[]
 This is an array that includes the name of the coordinate system associated with each uniform to frame load.
Dir
Type: System.Int32[]
 This is an integer between 1 and 11, indicating the direction of the load.
Local 1 axis (only applies when CSys is Local)
Local 2 axis (only applies when CSys is Local)
Local 3 axis (only applies when CSys is Local)
X direction (does not apply when CSys is Local)
Y direction (does not apply when CSys is Local)
Z direction (does not apply when CSys is Local)
Projected X direction (does not apply when CSys is Local)
Projected Y direction (does not apply when CSys is Local)
Projected Z direction (does not apply when CSys is Local)
Gravity direction (only applies when CSys is Global)
Projected Gravity direction (only applies when CSys is Global)
 The positive gravity direction (see Dir = 10 and 11) is in the negative Global Z direction.
Value
Type: System.Double[]
 The uniform load value. [F/L^2]
DistType
Type: System.Int32[]
 This is either 1 or 2, indicating the load distribution type.
One-way load distribution
Two-way load distribution
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignments are retrieved for the area object specified by the Name item.
 If this item is Group, the assignments are retrieved for all area objects in the group specified by the Name item.
 If this item is SelectedObjects, assignments are retrieved for is made to all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the load assignments are successfully retrieved; otherwise it returns a nonzero value.
Remarks
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace